INSERT INTO students.public.student_groups (id, name)
VALUES
   (1, 'Группа1'),
   (2, 'Группа2'),
   (3, 'Группа3'),
   (4, 'Группа4'),
   (5, 'Группа5');

INSERT INTO students.public.students (id, date_of_birth, first_name, last_name, patronymic, group_id)
VALUES
(1, '25-04-1999', 'Иван', 'Иванов', 'Иванович', 1),
(2, '12-02-1998', 'Александр', 'Аликин', 'Степанович', 2),
(3, '11-05-1996', 'Радион', 'Грачев', 'Артёмович', 3),
(4, '13-08-1998', 'Максим', 'Глебов', 'Алексеевич', 4),
(5, '14-06-1997', 'Вячеслав', 'Макаров', 'Михайлович', 5),
(6, '15-03-1996', 'Алексей', 'Прохоров', 'Павлович', 1),
(7, '02-01-1997', 'Мария', 'Рынсевич', 'Германовна', 2),
(8, '22-07-1998', 'Лилия', 'Макарова', 'Ивановна', 3),
(9, '25-12-1999', 'Анастасия', 'Жукова', 'Федоровна', 4),
(10, '09-12-1999', 'Евгений', 'Соловьёв', 'Егорович', 5);

SELECT setval('hibernate_sequence', 11);

